cf/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ЧекККМ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыСобранные</xr:Item>
				<xr:Item>AccumulationRegister.СборкаЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыНаПеремещения</xr:Item>
				<xr:Item>AccumulationRegister.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ПриёмщикЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.СборкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятьРезерв</Name>
					<Comment>Не будет принимать резерв токо снимать (движения в минус но не в плюс)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьВСборку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ЯчеестаяИнвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеТоваров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазмещенияБезЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборочныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборочныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаОтправитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сборщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезервЯчеек</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Акция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ВнутреннийЗаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВнутреннийЗаказ</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.ОтгруженныеЗаказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.СборкаЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупитьНедостающее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РозничнаяЗаявка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиВЗакупку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазмещенияБезЗаказа</Name>
					<Comment>Если стоит значит резервироваться будет без учета сумм и заказа (новый вид ререзрвов)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтаДляОповещения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Почта</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъедененнаяСборка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъедененнаяСборка_УДАЛИТЬ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеВыдачиИнструмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияВыдачиИнструмента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВнутреннегоЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ПеремещениеТоваров/Ext/ObjectModule.bsl
Функция ПолучитьСкладСписания() Экспорт Возврат СкладОтправитель КонецФункции
Функция ПолучитьТекстЗапросаПолученияСпискаТоваров() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка
	|";
	
КонецФункции
Функция ПолучитьТекстЗапросаПолученияСпискаРезервируемыхТоваров() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка 
	//|И
	//|	ЕСТЬNULL(ДокументРезерва, НЕОПРЕДЕЛЕНО) <> НЕОПРЕДЕЛЕНО И
	//|	НЕ ДокументРезерва.Номер ЕСТЬ NULL
	|";
	
КонецФункции

Процедура ЗаполнитьСкладИзШапки(ИмяСклада) Экспорт
	
	Склад = ЭтотОбъект[ИмяСклада];
	
	Если Не Склад.Пустая() Тогда
	
		СтрокиБезСкладов = Товары.НайтиСтроки(Новый Структура(ИмяСклада, Справочники.Склады.ПустаяСсылка()));		
		
		Для Каждого Строка ИЗ СтрокиБезСкладов Цикл
			
			Строка[ИмяСклада] = Склад;
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

// ПРЕДОПРЕДЕЛЕННЫЕ ФУНКЦИИ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Последовательности
	
	//avdonin {{12.09.2010#
	//
	ПроведенияДокументов.ПоследовательностьОстаткиТоваров(ДополнительныеСвойства, ПринадлежностьПоследовательностям, Отказ);
	//}}avdonin
	
	// Проведение
	
	//ПроведенияДокументов.ТоварыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	
	// Запись
	
	Движения.Записать();
	
	// Контроль
	
	КонтрольПроведения.ПроверитьПоВсемРегистрам(ЭтотОбъект, Отказ, Заголовок);
	
	////Если Не РольДоступна("ПолныеПрава") тогда
	//		
	//	//avdonin {{21.09.2010#
	//	//
	//	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
	//		КонтрольПроведения.ПроверитьТоварыНаСкладах(
	//			ЭтотОбъект, 
	//			СкладОтправитель, 
	//			?(ДополнительныеСвойства.ПараметрыСистемы.КонтрольОстатков, Отказ, Ложь),
	//			Заголовок);
	//			
	//		КонтрольПроведения.ПроверитьТоварыНаСкладах(
	//			ЭтотОбъект, 
	//			СкладПолучатель, 
	//			?(ДополнительныеСвойства.ПараметрыСистемы.КонтрольОстатков, Отказ, Ложь),
	//			Заголовок);
	//	Иначе
	//		КонтрольПроведения.ПроверитьТоварыНаСкладахНЕОперативно(ЭтотОбъект, Отказ, Заголовок);
	//	КонецЕсли;
	//	//}}avdonin			
	//	
	//	
	//	Если Не Отказ Тогда
	//		КонтрольПроведения.ПроверитьТоварыВЯчейках(ЭтотОбъект, СкладОтправитель, Отказ, Заголовок);
	//	КонецЕсли;
		
	//КонецЕсли;
	
КонецПроцедуры
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Подготовка

	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриОтменеПроведенияДокумента(Ссылка);
	
	//avdonin {{12.09.2010#
	// надо опять инициализировать доп. свойства для контроля остатка (чтобы тянуть информацию только по тем остаткам, которые изменялись)
	// в контроле по идее имеет смысл указывать, что это отмена проведения или передавать движения
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	//}}avdonin
	
	// Последовательности
	
	//avdonin {{12.09.2010#
	// последний параметр - признак отмены проведения
	ПроведенияДокументов.ПоследовательностьОстаткиТоваров(ДополнительныеСвойства, ПринадлежностьПоследовательностям, Отказ, Истина);
	//}}avdonin
	
	// Запись
	
	Движения.ТоварыНаСкладах.Очистить();
	Движения.Записать();
	
	// Контроль
	
	КонтрольПроведения.ПроверитьПоВсемРегистрам(ЭтотОбъект, Отказ, Заголовок);
	
	//КонтрольПроведения.ПроверитьТоварыНаСкладах(
	//		ЭтотОбъект, 
	//		СкладОтправитель, 
	//		Отказ,
	//		Заголовок);
	//		
	//КонтрольПроведения.ПроверитьТоварыНаСкладах(
	//		ЭтотОбъект, 
	//		СкладПолучатель, 
	//		Отказ,
	//		Заголовок);
	//
	////avdonin {{22.09.2010#
	//// выше правда делается оперативный контроль
	//КонтрольПроведения.ПроверитьТоварыНаСкладахНЕОперативно(ЭтотОбъект, Отказ, Заголовок, Истина);
	//}}avdonin
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Если склад не заполнен тогда заполним его из шапок
	
	//ЗаполнитьСкладИзШапки("СкладОтправитель");
	//ЗаполнитьСкладИзШапки("СкладПолучатель");
	
		//наборЗаписей = ПринадлежностьПоследовательностям.ОстаткиТоваров;
		//наборЗаписей.Очистить();
		//
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//|	ПеремещениеТоваровТовары.Номенклатура,
		//|	Ссылка.СкладОтправитель,
		//|	Ссылка.СкладПолучатель
		//|ИЗ
		//|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		//|ГДЕ
		//|	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
		//
		//Запрос.УстановитьПараметр("Ссылка", Ссылка);
		//
		//Результат = Запрос.Выполнить();
		//Выборка = Результат.Выбрать();
		//
		//Пока Выборка.Следующий() Цикл
		//	новСтрока = наборЗаписей.Добавить();
		//	новСтрока.Склад = Выборка.СкладОтправитель;
		//	новСтрока.Номенклатура = Выборка.Номенклатура;
		//	новСтрока.Период = Дата;
		//	
		//	новСтрока = наборЗаписей.Добавить();
		//	новСтрока.Склад = Выборка.СкладПолучатель;
		//	новСтрока.Номенклатура = Выборка.Номенклатура;
		//	новСтрока.Период = Дата;
		//КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СкладОтправитель.Ячеестый И ТипЗнч(Основание) <> Тип("БизнесПроцессСсылка.ПеремещениеТоваров") Тогда
		ПроверяемыеРеквизиты.Добавить("Товары.ЯчейкаОтправитель");
	КонецЕсли;
	
	Если СкладПолучатель.Ячеестый Тогда
		ПроверяемыеРеквизиты.Добавить("Товары.ЯчейкаПолучатель");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Основание = ДанныеЗаполнения;
	
	ТипЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗаполнения = Тип("Структура") Тогда
		
		КонвертацияТипов.ЗаполнитьОбъектПоСтруктуреОснованию(ЭтотОбъект, ДанныеЗаполнения);
	
	ИначеЕсли ТипЗаполнения = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
		
		СкладПолучатель 	= ДанныеЗаполнения.Заказчик;
		СкладОтправитель 	= ДанныеЗаполнения.Склад;
		СнятьРезерв			= Истина;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ 
		|	Номенклатура, Количество, Упаковка,
		|	ВЫБОР КОГДА Размещение = &ПустойСклад ТОГДА НЕОПРЕДЕЛЕНО ИНАЧЕ &Заказ КОНЕЦ ДокументРезерва
		|ИЗ
		|	Документ.ВнутреннийЗаказ.Товары
		|ГДЕ
		|	Ссылка = &Заказ
		|");
		
		Запрос.УстановитьПараметр("Заказ", 			ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ПустойСклад", 	Справочники.Склады.ПустаяСсылка());
		
		Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ТипЗаполнения = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		
		СкладОтправитель 	= ДанныеЗаполнения.Склад;
		СнятьРезерв			= Истина;
		Основание			= ДанныеЗаполнения.Ссылка;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ 
		|	Ячейка ЯчейкаОтправитель, Номенклатура, Количество, Упаковка, Цена, СтавкаНДС, Сумма
		|ИЗ
		|	Документ.ПоступлениеТоваров.Товары
		|ГДЕ
		|	Ссылка = &Заказ
		|");
		
		Запрос.УстановитьПараметр("Заказ", 			ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ПустойСклад", 	Справочники.Склады.ПустаяСсылка());
		
		Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		
		СтруктураКолонокТовары = Новый Структура("ЕстьПроцентРучнойСкидки, ЕстьПроцентАвтоматическойСкидки, ТипЦен, Валюта, Партнер, ЕстьАкция, ЕстьЦенаПоАкции, ЕстьУпаковка, ЕстьКоличество, ЕстьЦена, ЕстьСуммаБезСкидки, ЕстьСумма, ЕстьСуммаАвтоматическойСкидки, ЕстьСуммаРучнойСкидки, ЕстьСтавкаНДС, ЕстьСуммаНДС, СуммаВключаетНДС, ЕстьВсего, ЕстьКоличествоВУпаковке",
												Ложь, Ложь, неопределено, Неопределено, Неопределено, ложь, ложь, Истина, Истина, Истина, Ложь, Истина, Ложь, Ложь, Истина, Ложь, Истина, Ложь, Истина);
												
		ФункцииФормДокументов.РассчитатьСуммыТабличныхЧастейВоВсехСтроках(Товары, СтруктураКолонокТовары);
		
	ИначеЕсли ТипЗаполнения = Тип("ДокументСсылка.ЧекККМ") Тогда
		
		СкладПолучатель 	= ДанныеЗаполнения.Склад;
		Основание			= ДанныеЗаполнения.Ссылка;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ 
		|	Номенклатура, Количество, Упаковка, Цена, СтавкаНДС, Сумма
		|ИЗ
		|	Документ.ЧекККМ.Товары
		|ГДЕ
		|	Ссылка = &Чек
		|");
		
		Запрос.УстановитьПараметр("Чек", ДанныеЗаполнения);
		Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры
